emacs/why-emacs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Why Emacs?</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Why Emacs?"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-25T02:04+0200"/>
<meta name="author" content="Andrey Kotlarski"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../css/worg-classic.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Why Emacs?</h1>

<p>"Why, oh, why use an ancient 30 year old program nowadays?"
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 When the whole is more than its parts</a></li>
<li><a href="#sec-2">2 When User is king</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> When the whole is more than its parts</h2>
<div class="outline-text-2" id="text-1">


<p>
What's the point of using Emacs for everything - editing whatever
code, compiling, debugging, version control, mail and news, shell and
REPL, DB prompts, remote access, document reading and writing,
planning, chat, even browsing?  For each of those there would be some
specialised program that does similar or better things and even
friendlier to users.
</p>
<ul>
<li>All-Emacs means more or less consistent interface.  No need to learn
  another specialised program with its specific set of idioms however
  simplified.

</li>
<li>Integration between different modules is much easier.  Making
  different programs even communicate would require tons of technical
  quirks if those programs were not intended for this.  And this is
  not in the hands of the users.
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> When User is king</h2>
<div class="outline-text-2" id="text-2">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-25T02:04+0200</p>
<p class="author">Author: Andrey Kotlarski</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
